In [4]:
import pandas as pd
import numpy as np

In [6]:
train=pd.read_csv("pandas_tut/dataset/train.csv")

In [7]:
train.shape

(891, 12)

In [9]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# Target Variable-->
# whether Survived or not

In [11]:
train.Survived.value_counts()

0    549
1    342
Name: Survived, dtype: int64

In [16]:
train.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [14]:
train[train.Sex=="female"].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [20]:
train.isnull().sum()         #for any null value in the data set

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [22]:
train.Fare.sort_values(ascending=False).head()       #OR

679    512.3292
258    512.3292
737    512.3292
341    263.0000
438    263.0000
Name: Fare, dtype: float64

In [23]:
train.sort_values(by='Fare',ascending=False).head()      #to get details of most paid fares

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S

In [31]:
train[train.Fare==0].shape

(15, 12)

In [33]:
train.Fare[train.Fare==0].value_counts()            #to count the number of 0.0 specifically

0.0    15
Name: Fare, dtype: int64

In [35]:
train.Fare.value_counts().index       #to get the whole series

Float64Index([   8.05,    13.0,  7.8958,    7.75,    26.0,    10.5,   7.925,
                7.775,   26.55,     0.0,
              ...
                  8.3, 13.7917,   9.475, 13.4167, 26.3875,  8.4583,  9.8375,
               8.3625, 14.1083,    17.4],
             dtype='float64', length=248)

In [36]:
train.Fare.value_counts()[0.0]        #to count the number of 0.0 specifically

15

In [30]:
train.Fare.value_counts()

8.0500      43
13.0000     42
7.8958      38
7.7500      34
26.0000     31
10.5000     24
7.9250      18
7.7750      16
26.5500     15
0.0000      15
7.2292      15
7.8542      13
8.6625      13
7.2500      13
7.2250      12
16.1000      9
9.5000       9
24.1500      8
15.5000      8
56.4958      7
52.0000      7
14.5000      7
14.4542      7
69.5500      7
7.0500       7
31.2750      7
46.9000      6
30.0000      6
7.7958       6
39.6875      6
            ..
7.1417       1
42.4000      1
211.5000     1
12.2750      1
61.1750      1
8.4333       1
51.4792      1
7.8875       1
8.6833       1
7.5208       1
34.6542      1
28.7125      1
25.5875      1
7.7292       1
12.2875      1
8.6542       1
8.7125       1
61.3792      1
6.9500       1
9.8417       1
8.3000       1
13.7917      1
9.4750       1
13.4167      1
26.3875      1
8.4583       1
9.8375       1
8.3625       1
14.1083      1
17.4000      1
Name: Fare, Length: 248, dtype: int64

In [40]:
train.Fare[train.Fare<100].value_counts().sum()       #people who paid less than 100 fare

838L

In [43]:
train[train.Fare<100].shape

(838, 12)

In [44]:
train[train.Fare<100].agg(['count'])['Fare']

count    838
Name: Fare, dtype: int64

In [45]:
train[train.Fare<100].agg(['count'])        #to get count of everything

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,838,838,838,838,838,666,838,838,838,838,161,836

In [46]:
t=train[train.Fare==0]
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S

In [47]:
t.Sex.value_counts()

male    15
Name: Sex, dtype: int64

In [48]:
t.Survived.value_counts()

0    14
1     1
Name: Survived, dtype: int64

In [49]:
u=train[train.Survived==1]
u.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [50]:
u.Sex.value_counts()

female    233
male      109
Name: Sex, dtype: int64

In [51]:
train.Survived[train.Sex=="female"].value_counts()        #female counts of survival

1    233
0     81
Name: Survived, dtype: int64

In [52]:
v=u[u.Sex=="female"]     #survived females

In [55]:
v[v.Age<15].shape         #females less than 15 age

(24, 12)

In [57]:
u[(u.Sex=="male") & (u.Age<15)].shape       #male that survived

(21, 12)

In [65]:
train[(train.Age<21) & (train.Sex=="male") & (train.Fare==0)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S

In [70]:
train.loc[[302],:]           #labels are the indeces that are present in the index which can be accessed by loc
                            #iloc access the index location starting from 0
    #eg-like if an entry has index 4 but its the first entry then iloc has to be set 1 and label will be set 4 for its accessing.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S